# 채팅창으로 전송된 파일을 프로젝트로 설정된
# 폴더로 복사하시고
# 파일을 열기한 후 풀어보세요
# 다 완성하시면 day1_퀴즈_수강생명.py 로 전송해주세요
# coderecipe@naver.com

# 퀴즈 1:
# 아래와 같이 3줄로 글자를 출력하는 4가지 방법은?
'''
파이썬
파이썬
파이썬
'''

# 퀴즈 2
# 홍길동 씨의 과목별 점수는 다음과 같다.
# 홍길동 씨의 평균 점수를 소숫점 둘째자리까지 출력하여라
'''
국어 : 86
영어 : 77
수학 : 55
평균 : ?
'''

# 퀴즈 3
# 변수 a,b를 입력문을 이용하여 데이터를 저장한다.
# == 을 이용하여 a,b 가 같은지 True, False 로
# 출력하여라
'''
a값 입력 => 10
b값 입력 => 10
True
'''

# 퀴즈 4
# 2개의 숫자를 입력받아 다음과 같이 출력하여라
# % 포맷 이용

# '''
# 숫자1을 입력하세요... 12
# 숫자2를 입력하세요... 12.345
#
# 입력받은 숫자1은 12 입니다.
# 입력받은 숫자1은 8진수로 14 입니다.
# 입력받은 숫자1은 16진수로 c 입니다.
# 입력받은 숫자2는 12.3 입니다.
# '''

# 퀴즈 5
# 홍길동씨의 주민등록번호는 881120-1068234
# 연월일과 숫자 부분을 나누어서 출력하여라.
'''
연월일 : 881120
숫자 : 1068234
'''

# 퀴즈 6
# 2개의 변수를 정의하고 아래와 같이 출력한다.
# format 또는 % 또는 f'' 이용

'''
movie1 = '알라딘'
movie2 = '스파이더맨'

--------------
오늘의 영화 => 스파이더맨 , 알라딘

'''

# 퀴즈 7
# 다음과 같이 문자열 변수를 정의하고 결과값이 출력되도록 한다.
'''
Let thy speech be short, comprehending much in few words.

결과 >> 
첫번째 t의 위치 : ?
첫번째 m의 위치 : ?
s 의 갯수 : ?

= 이 모든 글자 사이에 연결되게 표시 : ?
 
모두 대문자로 표시 : ? 

'''

# 퀴즈 8
# 아래와 같이 변수를 지정하고
# humidity = 82
# temperature = -1.8
# % 포맷, format(), f' 포맷 3가지 방식을 이용하여 다음과 같이 출력하여라

'''
오늘의 날씨 : 맑음, 습도 82%, 현재기온 -1.8
'''

